000010* R = Red
000020* B = Blue
000030* Y = Yellow
000040* G = Green
000050* W = White
000060* b = Black
000070 IDENTIFICATION DIVISION.
000080 PROGRAM-ID. MASTERMIND.
000090 DATA DIVISION.
000100     WORKING-STORAGE SECTION.
000110         01 COLORS PIC X(6) VALUE "RBYGWb".
000120         01 SEED PIC 99.
000130         01 CHAR-INDEX PIC 99.
000140         77 TRIES PIC 99.
000150         77 OCCURENCES PIC 99.
000160         01 BREAK-CODE PIC X(4).
000170         01 GUESS-CODE PIC X(4).
000180 PROCEDURE DIVISION.
000190     PERFORM GENERATE-PARA.
000200     PERFORM GUESS-PARA 10 TIMES.
000210     PERFORM LOST-PARA.
000220 STOP RUN.
000230     GENERATE-PARA.
000240*        Generate first color        
000250         ACCEPT SEED FROM TIME.
000260         COMPUTE CHAR-INDEX = FUNCTION RANDOM(SEED) * 5 + 1.
000270         STRING COLORS(CHAR-INDEX:1) INTO BREAK-CODE(1:1).
000280*        Generate second color
000290         ACCEPT SEED FROM TIME.
000300         ADD 1 TO SEED.
000310         COMPUTE CHAR-INDEX = FUNCTION RANDOM(SEED) * 5 + 1.
000320         STRING COLORS(CHAR-INDEX:1) INTO BREAK-CODE(2:1).
000330*        Generate third color
000340         ACCEPT SEED FROM TIME.
000350         ADD 2 TO SEED.
000360         COMPUTE CHAR-INDEX = FUNCTION RANDOM(SEED) * 5 + 1.
000370         STRING COLORS(CHAR-INDEX:1) INTO BREAK-CODE(3:1).
000380*        Generate fourth color
000390         ACCEPT SEED FROM TIME.
000400         ADD 3 TO SEED.
000410         COMPUTE CHAR-INDEX = FUNCTION RANDOM(SEED) * 5 + 1.
000420         STRING COLORS(CHAR-INDEX:1) INTO BREAK-CODE(4:1).
000430*        DISPLAY "THE CODE IS " BREAK-CODE.
000440     WIN-PARA.
000450         DISPLAY "-------------------".
000460         DISPLAY "YOU BROKE THE CODE".
000470         DISPLAY "IT TOOK YOU " TRIES " TRIES".
000480         STOP RUN.
000490     LOST-PARA.
000500         DISPLAY "-------------------".
000510         DISPLAY "YOU LOST".
000520         DISPLAY "THE CODE WAS " BREAK-CODE.
000530         STOP RUN.
000540     GUESS-PARA.
000550         DISPLAY "-------------------".
000560         DISPLAY "GUESS THE CODE".
000570         ACCEPT GUESS-CODE.
000580         ADD 1 TO TRIES.
000590         IF GUESS-CODE = BREAK-CODE THEN
000600             PERFORM WIN-PARA.
000610         DISPLAY "-------------------".
000620*        Check for first color  
000630         MOVE 0 TO OCCURENCES.
000640         IF GUESS-CODE(1:1) = BREAK-CODE(1:1) THEN
000650             DISPLAY "BLACK"
000660         ELSE
000670             INSPECT GUESS-CODE TALLYING OCCURENCES
000680                 FOR ALL BREAK-CODE(1:1)
000690         END-IF.
000700         IF OCCURENCES > 0 THEN
000710             DISPLAY "WHITE".
000720*        Check for second color
000730         MOVE 0 TO OCCURENCES.
000740         IF GUESS-CODE(2:1) = BREAK-CODE(2:1) THEN
000750             DISPLAY "BLACK"
000760         ELSE
000770             INSPECT GUESS-CODE TALLYING OCCURENCES
000780                 FOR ALL BREAK-CODE(2:1)
000790         END-IF.
000800         IF OCCURENCES > 0 THEN
000810             DISPLAY "WHITE".
000820*        Check for third color
000830         MOVE 0 TO OCCURENCES.
000840         IF GUESS-CODE(3:1) = BREAK-CODE(3:1) THEN
000850             DISPLAY "BLACK"
000860         ELSE
000870             INSPECT GUESS-CODE TALLYING OCCURENCES 
000880                 FOR ALL BREAK-CODE(3:1)
000890         END-IF.
000900         IF OCCURENCES > 0 THEN
000910             DISPLAY "WHITE".
000920*        Check for fourth color
000930         MOVE 0 TO OCCURENCES.
000940         IF GUESS-CODE(4:1) = BREAK-CODE(4:1) THEN
000950             DISPLAY "BLACK"
000960         ELSE
000970             INSPECT GUESS-CODE TALLYING OCCURENCES
000980                 FOR ALL BREAK-CODE(4:1)
000990         END-IF.
001000         IF OCCURENCES > 0 THEN
001010             DISPLAY "WHITE".
