000010* R = Red
000020* G = Green
000030* B = Blue
000040* Y = Yellow
000050* W = White
000060* K = Black
000070 IDENTIFICATION DIVISION.
000080 PROGRAM-ID. MASTERMIND.
000090 DATA DIVISION.
000100     WORKING-STORAGE SECTION.
000110         77 COLORS PIC X(6) VALUE "RGBYWK".
000120         77 SEED PIC 99.
000130         77 CHAR-INDEX PIC 99.
000140         77 TRIES PIC 99.
000150         77 OCCURENCES PIC 99.
000160         77 BREAK-CODE PIC X(4).
000170         77 GUESS-CODE PIC X(4).
000180         77 CHECK-INDEX PIC 9 VALUE 1.
000190 PROCEDURE DIVISION.
000200     PERFORM GENERATE-PARA.
000210     PERFORM GUESS-PARA 10 TIMES.
000220     PERFORM LOST-PARA.
000230 STOP RUN.
000240     GENERATE-PARA.
000250*        Generate first color        
000260         ACCEPT SEED FROM TIME.
000270         COMPUTE CHAR-INDEX = FUNCTION RANDOM(SEED) * 5 + 1.
000280         STRING COLORS(CHAR-INDEX:1) INTO BREAK-CODE(1:1).
000290*        Generate second color
000300         ADD 1 TO SEED.
000310         COMPUTE CHAR-INDEX = FUNCTION RANDOM(SEED) * 5 + 1.
000320         STRING COLORS(CHAR-INDEX:1) INTO BREAK-CODE(2:1).
000330*        Generate third color
000340         ADD 1 TO SEED.
000350         COMPUTE CHAR-INDEX = FUNCTION RANDOM(SEED) * 5 + 1.
000360         STRING COLORS(CHAR-INDEX:1) INTO BREAK-CODE(3:1).
000370*        Generate fourth color
000380         ADD 1 TO SEED.
000390         COMPUTE CHAR-INDEX = FUNCTION RANDOM(SEED) * 5 + 1.
000400         STRING COLORS(CHAR-INDEX:1) INTO BREAK-CODE(4:1).
000410*        DISPLAY "THE CODE IS " BREAK-CODE.
000420     WIN-PARA.
000430         DISPLAY "YOU BROKE THE CODE".
000440         DISPLAY "IT TOOK YOU " TRIES " TRIES".
000450         STOP RUN.
000460     LOST-PARA.
000470         DISPLAY "YOU LOST".
000480         DISPLAY "THE CODE WAS " BREAK-CODE.
000490         STOP RUN.
000500     
000510     CHECK-PARA.
000520         MOVE 0 TO OCCURENCES.
000530         IF GUESS-CODE(CHECK-INDEX:1) = BREAK-CODE(CHECK-INDEX:1)
000540             THEN DISPLAY "BLACK"
000550         ELSE
000560             INSPECT BREAK-CODE TALLYING OCCURENCES
000570                 FOR ALL GUESS-CODE(CHECK-INDEX:1)
000580         END-IF.
000590         IF OCCURENCES > 0 THEN
000600             DISPLAY "WHITE".
000610
000620     GUESS-PARA.
000630         DISPLAY "-------------------".
000640         DISPLAY "GUESS THE CODE".
000650         ACCEPT GUESS-CODE.
000660         DISPLAY "-------------------".
000670         ADD 1 TO TRIES.
000680*        Check if guess is correct
000690         IF GUESS-CODE = BREAK-CODE THEN
000700             PERFORM WIN-PARA.
000710*        Check for first color  
000720         MOVE 1 TO CHECK-INDEX.
000730         PERFORM CHECK-PARA.
000740*        Check for second color
000750         MOVE 2 TO CHECK-INDEX.
000760         PERFORM CHECK-PARA.
000770*        Check for third color
000780         MOVE 3 TO CHECK-INDEX.
000790         PERFORM CHECK-PARA.
000800*        Check for fourth color
000810         MOVE 4 TO CHECK-INDEX.
000820         PERFORM CHECK-PARA.
